Julita Wójcik, nr indeksu: 406282, gr.lab. 3

Zajęcia - piątek godz. 9.30

Laboratorium 2

In [1]:
#import bazy

import psycopg2 as pg
import pandas as pd

connection = pg.connect(host='pgsql-196447.vipserv.org', port=5432, dbname='wbauer_adb', user='wbauer_adb', password='adb2020')

## ZADANIA

#### 1. Ile kategorii filmów mamy w wypożyczalni?

In [2]:
# count() - zlicza elementy w kolumnie
df = pd.read_sql('select count(category)_id FROM category', con=connection)
df

C:\Users\DELL\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   _id
0   16

#### 2. Wyświetl listę kategorii w kolejności alfabetycznej.

In [3]:
# order by - sortowanie 
df = pd.read_sql('select name from category ORDER BY name', con=connection)
df

C:\Users\DELL\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

#### 3. Znajdź najstarszy i najmłodszy film do wypożyczenia.

In [4]:
# limit x - ograniczenie do x wyświetlanych wierszy
# desc - sortowanie odwrotne

df1 = pd.read_sql('select release_year from film ORDER BY release_year LIMIT 1', con=connection)
print(df1)
df2 = pd.read_sql('select release_year from film ORDER BY release_year desc LIMIT 1', con=connection)
print(df2)

C:\Users\DELL\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   release_year
0          2006
   release_year
0          2006

C:\Users\DELL\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

#### 4. Ile wypożyczeń odbyło się między 2005-07-01 a 2005-08-01?

In [5]:
# between x and y - wyszukiwanie elementów w zadanym przedziale
# w poniższym przykładzie należało uzupełnić daty godzinami, aby uzyskać informacje

df = pd.read_sql("select count(rental_date) from rental WHERE rental_date BETWEEN '2005-07-01 00:00:00' AND '2005-08-01 23:59:59'",con=connection)
df

C:\Users\DELL\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0   7380

#### 5.Ile wypożyczeń odbyło się między 2010-01-01 a 2011-02-01?

In [6]:
df = pd.read_sql("select count(rental_date) from rental WHERE rental_date BETWEEN '2010-01-01 00:00:00'::timestamp AND '2011-02-01 00:00:00'::timestamp",con=connection)
df

C:\Users\DELL\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0      0

#### 6.Znajdź największą płatność wypożyczenia.

In [7]:
# max() - wyświetla maksymalną wartość w zadanej kolumnie

df = pd.read_sql('select max(amount) FROM payment', con=connection)
df

C:\Users\DELL\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

     max
0  11.99

#### 7. Znajdź wszystkich klientów z Polski, Nigerii lub Bangladeszu.

In [8]:
# inner join - wyszukuje części wspólne po zadanych kolumnach 

txt = """
    SELECT first_name, last_name, ctr.country
    FROM customer c
    INNER JOIN address a ON a.address_id = c.address_id
    INNER JOIN city ct  ON ct.city_id = a.city_id
    INNER JOIN country ctr ON ctr.country_id = ct.country_id
    WHERE ctr.country IN ('Poland','Nigeria', 'Bangladesh')
    
"""
df = pd.read_sql(txt, con=connection)
df

C:\Users\DELL\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   first_name  last_name     country
0       Sonia    Gregory     Nigeria
1       Brian      Wyman      Poland
2      Sidney   Burleson      Poland
3      Rodney    Moeller     Nigeria
4     Stephen     Qualls  Bangladesh
5       Velma      Lucas     Nigeria
6     Marilyn       Ross     Nigeria
7       Elsie     Kelley     Nigeria
8      Gladys   Hamilton     Nigeria
9       Frank   Waggoner  Bangladesh
10   Marjorie     Tucker      Poland
11      Carol     Garcia     Nigeria
12       Leah     Curtis      Poland
13      Ruben      Geary      Poland
14       Olga    Jimenez     Nigeria
15     Bertha   Ferguson     Nigeria
16     Tracey    Barrett     Nigeria
17         Jo     Fowler     Nigeria
18    Johnnie   Chisholm      Poland
19    Wallace      Slone     Nigeria
20   Michelle      Clark  Bangladesh
21    Russell    Brinson      Poland
22     Jimmie  Eggleston      Poland
23  Constance       Reid     Nigeria

#### 8.Gdzie mieszkają członkowie personelu

In [9]:
txt = """
    SELECT  a.staff_id, adr.address
    FROM address adr
    INNER JOIN staff a ON a.address_id = adr.address_id
    
"""
df = pd.read_sql(txt, con=connection)
df

C:\Users\DELL\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   staff_id               address
0         1     23 Workhaven Lane
1         2  1411 Lillydale Drive

#### 9.Ilu pracowników mieszka w Argentynie lub Hiszpanii?

In [10]:
txt = """
    SELECT count(staff_id)
    FROM staff st
    INNER JOIN address a ON a.address_id = st.address_id
    INNER JOIN city ct  ON ct.city_id = a.city_id
    INNER JOIN country ctr ON ctr.country_id = ct.country_id
    WHERE ctr.country IN ('Spain','Argentina')
    
"""
df = pd.read_sql(txt, con=connection)
df

C:\Users\DELL\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0      0

#### 10.Jakie kategorie filmów zostały wypożyczone przez klientów?

In [11]:
txt = """
    SELECT distinct name
    FROM category c
    INNER JOIN film_category f_c ON c.category_id = f_c.category_id
    INNER JOIN film f  ON f.film_id = f_c.film_id
    INNER JOIN inventory inv ON inv.film_id = f.film_id
    INNER JOIN rental ren ON inv.inventory_id = ren.inventory_id
    
"""
df = pd.read_sql(txt, con=connection)
df

C:\Users\DELL\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

           name
0        Sports
1      Classics
2           New
3        Family
4        Comedy
5     Animation
6        Travel
7         Music
8         Drama
9        Horror
10       Sci-Fi
11        Games
12  Documentary
13      Foreign
14       Action
15     Children

#### 11.Znajdź wszystkie kategorie filmów wypożyczonych w Ameryce.

In [12]:
txt = """
    SELECT distinct name
    FROM category c
    INNER JOIN film_category f_c ON c.category_id = f_c.category_id
    INNER JOIN film f  ON f.film_id = f_c.film_id
    INNER JOIN inventory inv ON inv.film_id = f.film_id
    INNER JOIN rental ren ON inv.inventory_id = ren.inventory_id
    INNER JOIN customer cus ON cus.customer_id = ren.customer_id
    INNER JOIN address adr ON adr.address_id = cus.address_id
    INNER JOIN store st ON st.address_id = adr.address_id
    WHERE con.country IN ('United States')
    
"""
df = pd.read_sql(txt, con=connection)
df

C:\Users\DELL\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

#### 12. Znajdź wszystkie tytuły filmów, w których grał: Olympia Pfeiffer lub Julia Zellweger lub Ellen Presley

In [13]:
txt = """
    SELECT distinct title, a.first_name, a.last_name
    FROM film f
    INNER JOIN film_actor f_a ON f.film_id = f_a.film_id
    INNER JOIN actor a  ON a.actor_id = f_a.actor_id
    WHERE a.first_name IN ('Olympia') AND a.last_name IN ('Pfeiffer')
           OR a.first_name IN ('Julia') AND a.last_name IN ('Zellweger')
           OR a.first_name IN ('Ellen') and a.last_name IN ('Presley')
        
    
"""
df = pd.read_sql(txt, con=connection)
df

C:\Users\DELL\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

                   title first_name  last_name
0            Badman Dawn    Olympia   Pfeiffer
1        Bilko Anonymous      Ellen    Presley
2   Breakfast Goldfinger      Julia  Zellweger
3      Caribbean Liberty      Ellen    Presley
4       Casper Dragonfly      Ellen    Presley
..                   ...        ...        ...
64             Turn Star      Ellen    Presley
65            Wait Cider    Olympia   Pfeiffer
66          Women Dorado      Ellen    Presley
67             Won Dares      Julia  Zellweger
68         Wyoming Storm      Julia  Zellweger

[69 rows x 3 columns]